<?php
/**
 * 游戏条款
 *
 * @author      mason X<83213956@qq.com>
 * @version     2.0.0
 *
 **/

try {
?>
<div class="card mb-3">
    <div class="card-header">
        服务条款
    </div>
    <div class="card-body">
        <ol>
            <li>
                <strong>法律协议:</strong><br />
                <p>您对本网站的使用始终受这些服务条款和我们的隐私政策的约束。这些内容（包括但不限于在网站上创建或提交给服务的用户身份）受这些条款的约束。这包括但不限于适当的游戏内和游戏外行为。本协议是对MuOnline软件随附且受MuOnline软件约束的《最终用户许可协议》的补充，但绝不能替代或替换。当您使用或购买某些其他MuOnline服务，会员服务，第三方内容或软件时，您还可能需要遵守适用的其他条款和条件。</p>
                <p>MuOnline建议所有用户定期查看这些条款，因为MuOnline是一个不断发展的社区。 MuOnline保留自行决定在不事先通知的情况下通过在我们的网站上发布修订或更新的协议来修改，修改，更改，添加，删除或更新这些条款和服务的权利，恕不另行通知。 。经修订或更新的协议在发布后生效，并且在您在网站上通知和发布经修订或更新的协议后，您继续使用网站和服务即表示您接受更新条款。如果您不同意这些修订或更新的条款，则有义务立即终止您的用户ID，并取消已注册的任何服务。</p>
            </li>
            <li>
                <strong>资格和年龄要求:</strong><br />
                <p>网站和服务适用于13岁以上的用户。根据2000年的《儿童在线隐私保护法》，如果您未满13岁，则无法从您那里收集个人信息，因此，禁止您通过服务创建会员帐户，没有资格输入任何信息。奖项颁奖活动和/或促销活动，请不要在网站上，通过服务或向我们提供任何形式的个人信息。</p>
                <p>如前所述，网站和服务适用于13岁以上的用户。尽管各个年龄段的孩子都可以浏览本网站，但只有13岁或13岁以上的儿童可以使用本网站以及相关的游戏和服务。我们不会有意接受13岁以下任何人的任何申请或其他提交的内容。如果我们得知13岁以下的任何人都在尝试提出申请或下订单，我们将在可行的情况下终止交易因此，随后删除发送给我们的任何个人信息。另外，我们不会在本网站上有意接受，收集，维护或使用有关13岁以下儿童的个人信息。</p>
                <p>如果孩子的父母或法定监护人发现其13岁以下的孩子向我们提供了个人身份信息，并且希望MuOnline停止收集此类信息，或者希望从我们的数据库记录中删除该孩子的个人信息，则应联系我们在contact@MuOnline.com。我们将在合理的时间内按要求审查，更新或删除孩子的信息。</p>
                <p>如果您超过13岁，但根据相关州的法律仍被视为未成年人，我们请您与父母或法定监护人一起阅读这些条款以及我们的隐私权政策，以确保他们了解并同意他们。我们强烈鼓励父母或法定监护人为孩子们树立积极积极的榜样，并与他们的孩子一起上网度过，熟悉服务并监督孩子与其他任何互联网用户之间的交流。强烈建议父母或法定监护人对孩子进行有关在线行为的教育，尤其包括但不限于从不透露，分发或以其他方式传达其个人识别信息，例如真实姓名，图像，地址或电话号码，而无需父母或监护人。使用互联网时获得监护人的许可。</p>
                <p>MuOnline是一个不断发展的社区，由具有不同经验和背景的许多不同参与者组成。虽然我们可能选择监视不当的玩家行为，聊天或链接至该服务并采取措施，但在任何时候，该服务上或通过该服务可能会访问不适合儿童使用或冒犯他人的语言或其他材料任何年龄段的用户。该协议概述了玩家访问服务的行为规则。我们不能确保所有玩家都遵守这些条款，并且不提供父母或监护人可能认为不合适或任何用户反对的内容或访问内容。 MuOnline不会预先筛选每个播放器传输的内容，材料或通信。因此，强烈鼓励父母为未成年以下的用户提供指导，并在限制孩子访问此类内容时行使父母的责任。</p>
            </li>
            <li>
                <strong>用户身份/帐户创建:</strong> <br />
                <p>通过填写并提交MuOnline注册表格创建用户身份（“用户ID”，“帐户”）时，表示您已阅读，理解并完全遵守本条款。您还必须在注册过程中提供真实准确的信息，并证明自己是谁。如果您是未成年人，则您的父母或监护人必须主持您的注册过程和/或为您完成注册过程，在这种情况下，他们将对本协议下的所有义务承担全部责任，并承担全部责任您或任何其他方通过帐户进行的所有活动，无论是否由注册用户授权。</p>
                <p>在注册过程中，您必须选择由唯一的登录名（“用户ID”，“帐户名”）和安全密码（“密码”）组成的登录信息（“登录信息”）。</p>
                <p>作为用户ID的创建者，您应对自己的身份完全负责，MuOnline将不容忍令人反感，淫秽或其他不当用户身份。如果用户ID违反本条款的任何部分（由MuOnline支持人员全权决定），则我们可能会立即，临时或永久禁止在站点或服务中使用该用户ID，恕不另行通知或事先警告。</p>
            </li>
            <li>
                <strong>帐户安全性：</strong> <br />
                <p>您作为帐户的注册用户，对对登录信息和用于访问站点或服务的计算机系统的机密性负有最终责任。此外，无论是否经您授权，您应对登录信息的任何和所有使用承担全部责任，并承担全部责任。您不得出于任何原因在任何时候直接或间接将密码泄露给任何人或允许其他任何人访问该帐户。严格禁止共享，交易，交换，出售，购买，交换或以其他方式分发帐户或帐户/登录信息，并且将由我们的支持人员全权酌情决定采取纪律处分措施，甚至可能终止服务。 MuOnline绝不会要求您提供帐户密码，并且您永远也不应透露它；即使在就帐户问题与我们联系时也是如此。</p>
                <p>在创建用户ID时，您同意赔偿MuOnline及其附属公司不受任何不当使用该身份的损害，包括但不限于以任何方式向其泄露密码的某人的不当使用或非法使用。 MuOnline对您的用户ID的任何滥用概不负责，无论这种滥用是您本人还是第三方。在任何在线社区中进行互动时，我们强烈建议所有玩家始终在点击并进行安全互联网操作之前先三思。</p>
                <p>如果您发现帐户登录信息的机密性受到损害，则需要立即通过邮箱或通过MuOnline帮助台提交帮助请求，以尽快如实地向MuOnline报告。我们将与适当的调查机构进行协调，以追究从事在线犯罪的个人的行为，包括提交欺诈或虚假报告的人。</p>	</li>
            <li>
                <strong>纪律处分和用户ID终止：</strong> <br />
                <p> MuOnline可以并且确实会发出警告以及由于用户违规而暂时中止和永久终止用户身份的行为。对于何时以及如何施加警告，处罚和/或纪律处分，我们保留全权决定权。违规的严重程度和发生次数是决定的因素，但它们并不是唯一使用的措施。在没有事先警告的情况下，可能会暂时和永久禁止用户身份。</p>
                <p>为避免任何疑问，您承认MuOnline在处罚和纪律处分方面拥有全权酌情决定权，即使您的帐户中仍有信用额度。</p>
                <p>如果您觉得您或您的用户ID受到不公正的警告或纪律处分，请在MuOnline帮助中心提交帮助请求，或将有关细节的邮箱发送至contact@MuOnline.com。所有提交的帐户操作纠纷将得到仔细审查，但MuOnline只会在确定有效索赔后采取行动。</p>
            </li>
            <li>
                <strong>付款网关：</strong> <br />
                <p> MuOnline致力于通过站点和服务提供免费的优质游戏。不需要用户购买游戏中的物品即可充分享受该服务，但是，用户可以使用PaymentWall向他们的帐户中收取虚拟货币，以获取这些已收费的物品。在使用任何一种支付网关之前，MuOnline建议您仔细阅读其服务条款，并确保您同意与本服务条款分开的条款。当您向MuOnline提供支付网关信息时，您向MuOnline表示您是用于获取虚拟货币的该支付网关帐户的授权用户。 MuOnline不属于PaymentWall。如果任何付款被撤回，取消或退款，则您在我们的帐户可能会立即被暂停，恕不另行通知；如果发现欺诈行为，该帐户可能会进一步被终止。</p>
            </li>
            <li>
                <strong>滥用漏洞/漏洞：</strong> <br />
                <p>完全禁止使用或滥用任何现有/已知的利用和/或错误。</p>
            </li>
            <li> <strong>服务器中断：</strong> <br />
                <p>将定期进行服务器维护和现场维护，通常同时进行新游戏或新服务。 MuOnline将尽最大努力将服务器停机时间限制在二十四小时。但是，MuOnline对因维护或其他停机时间造成的使用或数据丢失概不负责，您同意对此类损失不承担任何责任。</p>
                <p> MuOnline对服务器维护期间用户无法访问付费服务概不负责。</p>
                <p> MuOnline对因超出MuOnline合理控制范围之外的原因而导致的任何延迟或执行不承担任何责任，包括但不限于由于不可预见的情况或MuOnline无法控制的原因（如上帝的行为，战争，恐怖主义，暴动，禁运，文职或军事当局的行为，火灾，洪水，事故，罢工或运输设施，燃料，能源，劳动力或材料的短缺。</p>
                <p>此外，我们不能也不保证或保证您随时可以访问您的帐户，并且可能会延长您无法访问帐户的时间。您承担与硬件和软件有关的软件和游戏的结果和性能的全部风险，并承担硬件，软件的所有服务，维修和/或纠正的全部费用。</p>
            </li>
            <li>
                <strong>第三方站点：</strong> <br />
                <p>单击超链接可能会使您离开站点。 MuOnline不认可或控制任何第三方链接的网站，对其内容不承担任何责任，并且与此类网站的所有者或运营商没有任何关联。另外，其他站点可能具有不同的服务条款和不同的隐私政策。因此，MuOnline强烈建议您告知自己有关第三方网站的做法。</p>
            </li>
            <li>
                <strong>责任：</strong> <br />
                <p> MuOnline或其母公司，子公司，许可人或关联公司均不对由于（a）使用或无法使用服务而造成的任何形式的损害或损失承担任何责任，包括但不限于商誉的丧失，停工，计算机故障或故障； （b）关联游戏存储的玩家角色，帐户，统计数据，库存，用户个人资料信息的丢失或损坏； （c）服务中断，包括但不限于ISP中断，软件或硬件故障或任何其他可能导致数据丢失或服务中断的事件。 MuOnline决不对您或任何其他人承担任何直接，间接，偶然，特殊，示范性或后果性的损害赔偿。</p>
            </li>
            <li>
                <strong>赔偿：</strong> <br />
                <p>您同意就因不遵守这些条款或您因与之相关的任何非法行为或不当行为而引起或引起的任何索赔，损失，费用或损害，对MuOnline及其关联公司进行赔偿，并使之免受损害。您对本网站的使用或对本网站的访问。</p>
            </li>
            <li>
                <strong>服务更新或变更通知：</strong> <br />
                <p> MuOnline保留自行决定的权利，以更改，修改，添加，补充或删除访问政策，服务任何功能的可用性，可用性小时，内容，数据，软件或设备访问服务，无论有无事先通知均有效。但是，将在更改之前或之后披露重大更改（由MuOnline自行决定）。</p>
                <p> MuOnline将通过服务器维护，公告或通过邮箱向您提供对服务的任何此类更改的通知。如果您对本协议的任何将来更改都不可接受或导致您不再遵守本协议，则您必须终止并立即停止使用服务和帐户。在对本协议进行任何修订后，您继续使用本服务即构成您对所有此类更改的完全且不可撤消的接受。 MuOnline可以随时更改，修改，暂停或中断服务的任何方面。 MuOnline可能还会对某些功能进行限制，或限制您访问服务的部分或全部，恕不另行通知或承担责任。</p>
            </li>
            <li>
                <strong>附加条款：</strong> <br />
                <p>无效的地方。 无需购买就可以玩游戏。 本网站的运营商保留随时因任何原因或无故中止或终止玩家对本网站的访问的权利。 积分没有现金价值。</p>
            </li>
            <li>
                <strong>关闭：</strong> <br />
                <p>再次感谢您访问MuOnline。 我们希望您在这里过得愉快，并充分利用我们正在发展的在线社区。 请记住，您是本网站的客人，并且应以礼貌和尊重其他客人的态度行事。 MuOnline始终保留拒绝或终止服务的权利。</p>
            </li>
        </ol>
    </div>
</div>
<?php
} catch(Exception $ex) {
    message('error', $ex->getMessage());
}